/*                                   
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─██████──────────██████████████──████████████████────████████████────────────────────────────██████──██████████████──██████████████──██████─────────
─██░░██──────────██░░░░░░░░░░██──██░░░░░░░░░░░░██────██░░░░░░░░████──────────────────────────██░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██─────────
─██░░██──────────██░░██████░░██──██░░████████░░██────██░░████░░░░██──────────────────────────██░░██──██░░██████░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██────██░░██────██░░██──██░░██──────────────────────────██░░██──██░░██──██░░██──██░░██──────────██░░██─────────
─██░░██──────────██░░██──██░░██──██░░████████░░██────██░░██──██░░██──██████████████──────────██░░██──██░░██──██░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░░░░░░░░░░░██────██░░██──██░░██──██░░░░░░░░░░██──────────██░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██████░░████────██░░██──██░░██──██████████████──██████──██░░██──██░░██──██░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██──██░░██──────██░░██──██░░██──────────────────██░░██──██░░██──██░░██──██░░██──██░░██──────────██░░██─────────
─██░░██████████──██░░██████░░██──██░░██──██░░██████──██░░████░░░░██──────────────────██░░██████░░██──██░░██████░░██──██░░██████████──██░░██████████─
─██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██──██░░░░░░██──██░░░░░░░░████──────────────────██░░░░░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██─
─██████████████──██████████████──██████──██████████──████████████────────────────────██████████████──██████████████──██████████████──██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
made by bera 

*/
const _0x19cdbe = function () {
  const _0x5a0749 = {
    dNvkf: function (_0x2726af, _0x5a5343) {
      return _0x2726af === _0x5a5343;
    },
    nhlOb: "DXDZM"
  };
  _0x5a0749.XvOQV = "aFswq";
  _0x5a0749.pzgHZ = "NUJUv";
  _0x5a0749.xtadf = "mZrUE";
  _0x5a0749.sXZwy = "JVMmD";
  _0x5a0749.bSAyA = "gRgrm";
  let _0x4164c8 = true;
  return function (_0x3ac91b, _0x257918) {
    const _0x48cc39 = {
      'WeSso': function (_0x4e545d, _0x100e87) {
        return _0x4e545d === _0x100e87;
      },
      'JTqhc': "DXDZM",
      'faXHt': _0x5a0749.XvOQV,
      'rKpqy': function (_0x4db381, _0x69e830) {
        return _0x4db381 === _0x69e830;
      },
      'FTIVw': _0x5a0749.pzgHZ,
      'zaBqh': _0x5a0749.xtadf
    };
    if (_0x5a0749.sXZwy === _0x5a0749.bSAyA) {
      return true;
    } else {
      const _0xb09c75 = _0x4164c8 ? function () {
        if ("DXDZM" === _0x48cc39.faXHt) {
          if (_0x587544) {
            const _0x175098 = _0x17b893.apply(_0x1da089, arguments);
            _0x4293b7 = null;
            return _0x175098;
          }
        } else {
          if (_0x257918) {
            if (_0x48cc39.FTIVw === _0x48cc39.zaBqh) {
              const _0xf815db = _0x489bf2.apply(_0x4e9c66, arguments);
              _0x39d7b1 = null;
              return _0xf815db;
            } else {
              const _0x3ee6b8 = _0x257918.apply(_0x3ac91b, arguments);
              _0x257918 = null;
              return _0x3ee6b8;
            }
          }
        }
      } : function () {};
      _0x4164c8 = false;
      return _0xb09c75;
    }
  };
}();
const _0x852927 = _0x19cdbe(this, function () {
  return _0x852927.toString().search("(((.+)+)+)+$").toString().constructor(_0x852927).search("(((.+)+)+)+$");
});
_0x852927();
const _0x3738ff = function () {
  const _0x297523 = {
    TnnVG: function (_0x4c2f29, _0x46bd6e) {
      return _0x4c2f29 + _0x46bd6e;
    },
    xtQet: "debu",
    OGuYJ: "gger",
    QooJh: "action"
  };
  _0x297523.GGnvI = function (_0x788ffc, _0x1cbb99) {
    return _0x788ffc === _0x1cbb99;
  };
  _0x297523.TixCx = "KvdQR";
  _0x297523.glBxS = function (_0x3c30ca, _0x23fd41) {
    return _0x3c30ca === _0x23fd41;
  };
  _0x297523.sAQCD = "IFEXa";
  _0x297523.FkrUC = function (_0x252204, _0x57371a) {
    return _0x252204 !== _0x57371a;
  };
  _0x297523.jTbrV = "ndBoy";
  let _0x3fd6e2 = true;
  return function (_0xcf1857, _0x110aef) {
    if (_0x297523.FkrUC(_0x297523.jTbrV, _0x297523.jTbrV)) {
      _0x441a71 = "Good Evening 🌃";
    } else {
      const _0x14eca1 = _0x3fd6e2 ? function () {
        if (_0x297523.GGnvI(_0x297523.TixCx, _0x297523.TixCx)) {
          if (_0x110aef) {
            if (_0x297523.glBxS(_0x297523.sAQCD, _0x297523.sAQCD)) {
              const _0x2ee200 = _0x110aef.apply(_0xcf1857, arguments);
              _0x110aef = null;
              return _0x2ee200;
            } else {
              return false;
            }
          }
        } else {
          (function () {
            return true;
          }).constructor("debugger").call("action");
        }
      } : function () {};
      _0x3fd6e2 = false;
      return _0x14eca1;
    }
  };
}();
(function () {
  _0x3738ff(this, function () {
    const _0x34a418 = new RegExp("function *\\( *\\)");
    const _0x14c676 = new RegExp("\\+\\+ *(?:[a-zA-Z_$][0-9a-zA-Z_$]*)", 'i');
    const _0x336da5 = _0x1164ea("init");
    if (!_0x34a418.test(_0x336da5 + "chain") || !_0x14c676.test(_0x336da5 + "input")) {
      _0x336da5('0');
    } else {
      _0x1164ea();
    }
  })();
})();
(function () {
  let _0x5be0b;
  try {
    const _0x3a447b = Function("return (function() {}.constructor(\"return this\")( ));");
    _0x5be0b = _0x3a447b();
  } catch (_0x312e78) {
    _0x5be0b = window;
  }
  _0x5be0b.setInterval(_0x1164ea, 4000);
})();
const _0x3f428e = function () {
  let _0x2bff17 = true;
  return function (_0x47ba79, _0x4b3db8) {
    const _0x1e6b20 = _0x2bff17 ? function () {
      if (_0x4b3db8) {
        const _0x2ee5bd = _0x4b3db8.apply(_0x47ba79, arguments);
        _0x4b3db8 = null;
        return _0x2ee5bd;
      }
    } : function () {};
    _0x2bff17 = false;
    return _0x1e6b20;
  };
}();
const _0x3ff487 = _0x3f428e(this, function () {
  const _0x26e0f1 = function () {
    let _0xefb6d;
    try {
      _0xefb6d = Function("return (function() {}.constructor(\"return this\")( ));")();
    } catch (_0x5e541e) {
      _0xefb6d = window;
    }
    return _0xefb6d;
  };
  const _0x25c62c = _0x26e0f1();
  const _0x21e72d = _0x25c62c.console = _0x25c62c.console || {};
  const _0xab3f19 = ["log", "warn", "info", "error", "exception", "table", "trace"];
  for (let _0x1be7c0 = 0; _0x1be7c0 < _0xab3f19.length; _0x1be7c0++) {
    const _0x2fb440 = _0x3f428e.constructor.prototype.bind(_0x3f428e);
    const _0x5ca9be = _0xab3f19[_0x1be7c0];
    const _0x1c9e72 = _0x21e72d[_0x5ca9be] || _0x2fb440;
    _0x2fb440.__proto__ = _0x3f428e.bind(_0x3f428e);
    _0x2fb440.toString = _0x1c9e72.toString.bind(_0x1c9e72);
    _0x21e72d[_0x5ca9be] = _0x2fb440;
  }
});
_0x3ff487();
import _0x5b1d62 from 'moment-timezone';
import 'fs';
import 'os';
import _0x2c0de0 from '@whiskeysockets/baileys';
const {
  generateWAMessageFromContent,
  proto
} = _0x2c0de0;
import _0x320310 from '../../config.cjs';
const alive = async (_0x58614c, _0x213b6a) => {
  const _0x21d69b = _0x320310.PREFIX;
  const _0x564670 = _0x320310.MODE;
  const _0x548242 = _0x58614c.pushName || "User";
  const _0x1ae8f9 = _0x58614c.body.startsWith(_0x21d69b) ? _0x58614c.body.slice(_0x21d69b.length).split(" ")[0].toLowerCase() : '';
  if (_0x1ae8f9 === "settings") {
    await _0x58614c.React('💮');
    const _0x38093a = _0x5b1d62().tz("Kenya/kitale").format("HH:mm:ss");
    const _0x53ac76 = _0x5b1d62().tz("Kenya/kitale").format("HH:mm:ss");
    let _0x528d7b = '';
    if (_0x53ac76 < "05:00:00") {
      _0x528d7b = "Good Morning 🌄";
    } else {
      if (_0x53ac76 < "11:00:00") {
        _0x528d7b = "Good Morning 🌄";
      } else {
        if (_0x53ac76 < "15:00:00") {
          _0x528d7b = "Good Afternoon 🌅";
        } else {
          if (_0x53ac76 < "18:00:00") {
            _0x528d7b = "Good Evening 🌃";
          } else {
            if (_0x53ac76 < "19:00:00") {
              _0x528d7b = "Good Evening 🌃";
            } else {
              _0x528d7b = "Good Night 🌌";
            }
          }
        }
      }
    }
    const _0x139ec6 = "\n  YOUR NAME: *" + _0x548242 + "*\n  TIME: *" + _0x38093a + "*\n  TIME WISHE: *" + _0x528d7b + "*\n  SUDO_NUMBER: *" + _0x320310.SUDO_NUMBER + "*\n  OWNER_NUMBER: *" + _0x320310.OWNER_NUMBER + "*\n  OWNER_NAME : *LORD JOEL*\n  AUTO_REACT: *" + _0x320310.AUTO_REACT + "*\n  ALWAYS_ONLINE: *" + _0x320310.ALWAYS_ONLINE + "*\n  AUTO_RECORDING: *" + _0x320310.AUTO_RECORDING + "*\n  AUTO_READ: *" + _0x320310.AUTO_READ + "*\n  AUTO_TYPING: *" + _0x320310.AUTO_TYPING + "*\n  AUTO_REPLY_STATUS: *" + _0x320310.AUTO_REPLY_STATUS + "*\n  AUTOLIKE_STATUS: *" + _0x320310.AUTOLIKE_STATUS + "*\n  AUTO_STATUS_SEEN: *" + _0x320310.AUTO_STATUS_SEEN + "*\n  PREFIX: *" + _0x21d69b + "*\n  MODE: *" + _0x564670 + '*';
    await _0x58614c.React('☄️');
    const _0x3dfc52 = {
      newsletterJid: "120363317462952356@newsletter",
      newsletterName: "TREX MD",
      serverMessageId: -1
    };
    const _0x1dbbc0 = {
      title: "TREX MD",
      body: "TREX MD bot settings",
      thumbnailUrl: "https://avatars.githubusercontent.com/u/175513132?v=4",
      sourceUrl: "https://github.com/Berabruce/TREX-MD",
      mediaType: 0x1,
      renderLargerThumbnail: false
    };
    const _0x24a258 = {
      isForwarded: false,
      forwardedNewsletterMessageInfo: _0x3dfc52,
      forwardingScore: 0x3e7,
      externalAdReply: _0x1dbbc0
    };
    const _0x2ed8a2 = {
      text: _0x139ec6,
      contextInfo: _0x24a258
    };
    _0x213b6a.sendMessage(_0x58614c.from, _0x2ed8a2, {
      'quoted': _0x58614c
    });
  }
};
export default alive;
function _0x1164ea(_0x10bef0) {
  function _0x239e94(_0x511ee6) {
    if (typeof _0x511ee6 === "string") {
      return function (_0x132717) {}.constructor("while (true) {}").apply("counter");
    } else {
      if (('' + _0x511ee6 / _0x511ee6).length !== 1 || _0x511ee6 % 20 === 0) {
        (function () {
          return true;
        }).constructor("debugger").call("action");
      } else {
        (function () {
          return false;
        }).constructor("debugger").apply("stateObject");
      }
    }
    _0x239e94(++_0x511ee6);
  }
  try {
    if (_0x10bef0) {
      return _0x239e94;
    } else {
      _0x239e94(0);
    }
  } catch (_0x57720e) {}
}
